# GetMultiplanarDefinition Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarShape..::..GetMultiplanarDefinition Method
RebarShape Class See Also
---
The optional 3D structure of the shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeMultiplanarDefinition GetMultiplanarDefinition()
```

Visual Basic
---
```text
Public Function GetMultiplanarDefinition As RebarShapeMultiplanarDefinition
```

Visual C++
---
```text
public:
RebarShapeMultiplanarDefinition^ GetMultiplanarDefinition()
```

# ### Return Value
A copy of the multiplanar definition. Changes will not affect the RebarShape.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace